import { FaHandHoldingWater } from "react-icons/fa";

const brochos = [
  {
    count: 0,
    name: "עַל מִצְוַת צִיצִית",
    full: "בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל מִצְוַת צִיצִית",
    value: 1,
    maxPerDay: 1,
  },
  {
    count: 0,
    name: "לְהִתְעַטֵּף בַּצִיצִית",
    full: "בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהִתְעַטֵּף בַּצִיצִית",
    value: 1,
    maxPerDay: 1,
  },
  {
    count: 0,
    name: "לְהָנִיחַ תְּפִלִּין",
    full: "בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ לְהָנִיחַ תְּפִלִּין",
    value: 1,
    maxPerDay: 1,
  },
  {
    count: 0,
    name: "עַל מִצְוַת תְּפִלִּין",
    full: "בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל מִצְוַת תְּפִלִּין",
    value: 1,
    maxPerDay: 1,
  },
  {
    count: 0,
    name: "ברכת השחר",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר נָתַן לַשֶּׂכְוִי בִינָה לְהַבְחִין בֵּין יוֹם וּבֵין לָיְלָה: 


  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, שֶׁלֹּא עָשַׂנִי גּוֹי: 
  
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, שֶׁלֹּא עָשַׂנִי עָבֶד: 
  
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, שֶׁלֹּא עָשַׂנִי אִשָּׁה: 
  
  
  
  נשים מברכות: בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, שֶׁעָשַׂנִי כִּרְצוֹנוֹ:
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, פּוֹקֵחַ עִוְרִים: 
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, מַלְבִּישׁ עֲרֻמִּים: 
  
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, מַתִּיר אֲסוּרִים: 
  
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, זוֹקֵף כְּפוּפִים: 
  
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, רוֹקַע הָאָרֶץ עַל הַמָּיִם: 
  
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, הַמֵּכִין מִצְעֲדֵי גָבֶר: 
  
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, שֶׁעָשָׂה לִּי כָּל צָרְכִּי: 
  
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אוֹזֵר יִשְׂרָאֵל בִּגְבוּרָה: 
  
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, עוֹטֵר יִשְׂרָאֵל בְּתִפְאָרָה: 
  
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, הַנּוֹתֵן לַיָּעֵף כֹּחַ: 
  
  
  אין לענות אמן אחר ברכה זו כי הכל ברכה אחת עד לעמו ישראל: 
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, הַמַּעֲבִיר שֵׁנָה מֵעֵינָי וּתְנוּמָה מֵעַפְעַפָּי: 
  
  
  וִיהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ שֶׁתַּרְגִּילֵנוּ בְּתוֹרָתֶךָ, וְדַבְּקֵנוּ בְּמִצְוֹתֶיךָ, וְאַל תְּבִיאֵנוּ לֹא לִידֵי חֵטְא, וְלֹא לִידֵי עֲבֵרָה וְעָוֹן, וְלֹא לִידֵי נִסָּיוֹן, וְלֹא לִידֵי בִזָּיוֹן, וְאַל תַּשְׁלֶט בָּנוּ יֵצֶר הָרָע, וְהַרְחִיקֵנוּ מֵאָדָם רָע וּמֵחָבֵר רָע, וְדַבְּקֵנוּ בְּיֵצֶר הַטוֹב וּבְמַעֲשִׂים טוֹבִים, וְכֹף אֶת יִצְרֵנוּ לְהִשְׁתַּעְבֶּד לָךְ, וּתְנֵנוּ הַיּוֹם וּבְכָל יוֹם לְחֵן וּלְחֶסֶד וּלְרַחֲמִים בְּעֵינֶיךָ וּבְעֵינֵי כָל רוֹאֵינוּ, וְתִגְמְלֵנוּ חֲסָדִים טוֹבִים, בָּרוּךְ אַתָּה יְהֹוָה הַגּוֹמֵל חֲסָדִים טוֹבִים לְעַמּוֹ יִשְׂרָאֵל: 
  
  
  יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהַי וֵאלֹהֵי אֲבוֹתַי שֶׁתַּצִּילֵנִי הַיּוֹם וּבְכָל יוֹם מֵעַזֵּי פָנִים וּמֵעַזּוּת פָּנִים, מֵאָדָם רָע, מִיֵּצֶר רָע, וּמֵחָבֵר רָע, וּמִשָּׁכֵן רָע, וּמִפֶּגַע רָע, מֵעַיִן הָרָע, מִלָּשׁוֹן הָרָע, מִמַּלְשִׁינוּת, מֵעֵדוּת שֶׁקֶר, מִשִּׂנְאַת הַבְּרִיּוֹת, מֵעֲלִילָה, מִמִּיתָה מְשֻׁנָּה, מֵחֳלָיִם רָעִים, מִמִּקְרִים רָעִים וּמִשָּׂטָן הַמַּשְׁחִית, מִדִּין קָשֶׁה וּמִבַּעַל דִּין קָשֶׁה, בֵּין שֶׁהוּא בֶן בְּרִית וּבֵין שֶׁאֵינוֹ בֶן בְּרִית, וּמִדִּינָהּ שֶׁל גֵּיהִנֹּם:
  `,
    value: 15,
    maxPerDay: 1,
  },

  {
    count: 0,
    name: "עַל נְטִילַת יָדָיִם",
    full: "בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר קִדְּשָׁנוּ בְּמִצְוֹתָיו וְצִוָּנוּ עַל נְטִילַת יָדָיִם",
    value: 1,
    maxPerDay: null,
    icon: (
      <button className="btn">
        <FaHandHoldingWater />,
      </button>
    ),
  },
  {
    count: 0,
    name: "אֲשֶׁר יָצַר",
    full: "בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, אֲשֶׁר יָצַר אֶת הָאָדָם בְּחָכְמָה, וּבָרָא בוֹ נְקָבִים נְקָבִים, חֲלוּלִים חֲלוּלִים. גָּלוּי וְיָדוּעַ לִפְנֵי כִסֵּא כְבוֹדֶךָ, שֶׁאִם יִפָּתֵח אֶחָד מֵהֶם אוֹ יִסָּתֵם אֶחָד מֵהֶם, אִי אֶפְשַׁר לְהִתְקַיֵּם וְלַעֲמֹד לְפָנֶיךָ אֲפִלּוּ שָׁעָה אֶחָת. בָּרוּךְ אַתָּה יְהֹוָה, רוֹפֵא כָל בָּשָׂר וּמַפְלִיא לַעֲשׂוֹת:",
    value: 1,
    maxPerDay: null,
  },
  {
    count: 0,
    name: "אֱלֹהַי נְשָׁמָה",
    full: "אֱלֹהַי, נְשָׁמָה שֶׁנָּתַתָּ בִּי טְהוֹרָה הִיא. אַתָּה בְרָאתָהּ, אַתָּה יְצַרְתָּהּ, אַתָּה נְפַחְתָּהּ בִּי, וְאַתָּה מְשַׁמְּרָהּ בְּקִרְבִּי, וְאַתָּה עָתִיד לִטְּלָהּ מִמֶּנִּי, וּלְהַחֲזִירָהּ בִּי לֶעָתִיד לָבוֹא. כָּל זְמַן שֶׁהַנְּשָׁמָה בְּקִרְבִּי מוֹדֶה אֲנִי לְפָנֶיךָ יְהֹוָה אֱלֹהַי וֵאלֹהֵי אֲבוֹתַי. רִבּוֹן כָּל הַמַּעֲשִׂים אֲדוֹן כָּל הַנְּשָׁמוֹת. בָּרוּךְ אַתָּה יְהֹוָה, הַמַּחֲזִיר נְשָׁמוֹת לִפְגָרִים מֵתִים:",
    value: 1,
    maxPerDay: 1,
  },
  {
    count: 0,
    name: "הַמְלַמֵּד תּוֹרָה לְעַמּוֹ יִשְׂרָאֵל",
    full: ``,
    value: 1,
    maxPerDay: 1,
  },
  { count: 0, name: "נוֹתֵן הַתּוֹרָה", full: ``, value: 1, maxPerDay: 1 },
  {
    count: 0,
    name: "מֶלֶךְ מְהֻלָּל בַּתִּשְׁבָּחוֹת",
    full: `בָּרוּךְ שֶׁאָמַר וְהָיָה הָעוֹלָם. בָּרוּךְ הוּא. בָּרוּךְ אוֹמֵר וְעוֹשֶׂה. בָּרוּךְ גּוֹזֵר וּמְקַיֵּם: בָּרוּךְ עוֹשֶׂה בְרֵאשִׁית, בָּרוּךְ מְרַחֵם עַל הָאָרֶץ. בָּרוּךְ מְרַחֵם עַל הַבְּרִיּוֹת בָּרוּךְ מְשַׁלֵּם שָׂכָר טוֹב לִירֵאָיו. בָּרוּךְ חַי לָעַד וְקַיָּם לָנֶצַח בָּרוּךְ פּוֹדֶה וּמַצִּיל בָּרוּךְ שְׁמוֹ. בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם הָאֵל אָב הָרַחֲמָן הַמְהֻלָּל בְּפֶה עַמּוֹ מְשֻׁבָּח וּמְפֹאָר בִּלְשׁוֹן חֲסִידָיו וַעֲבָדָיו וּבְשִׁירֵי דָּוִד עַבְדֶּךָ נְהַלֶלְךָ יְהֹוָה אֱלֹהֵינוּ בִּשְׁבָחוֹת וּבִזְמִירוֹת וּנְגַדֶּלְךָ וּנְשַׁבֵּחֲךָ וּנְפָאֶרְךָ וְנַמְלִיכְךָ וְנַזְכִּיר שִׁמְךָ מַלְכֵּנוּ, אֱלֹהֵינוּ, יָחִיד, חַי הָעוֹלָמִים, מֶלֶךְ מְשֻׁבָּח וּמְפֹאָר עֲדֵי עַד שְׁמוֹ הַגָּדוֹל: בָּרוּךְ אַתָּה יְהֹוָה מֶלֶךְ מְהֻלָּל בַּתִּשְׁבָּחוֹת`,
    value: 1,
    maxPerDay: 1,
  },
  {
    count: 0,
    name: "יִשְׁתַּבַּח",
    full: `יִשְׁתַּבַּח שִׁמְךָ לָעַד מַלְכֵּנוּ, הָאֵל הַמֶּלֶךְ הַגָּדוֹל וְהַקָּדוֹשׁ בַּשָּׁמַיִם וּבָאָרֶץ, כִּי לְךָ נָאֶה, יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, שִׁיר וּשְׁבָחָה, הַלֵּל וְזִמְרָה, עֹז וּמֶמְשָׁלָה, נֶצַח, גְּדֻלָּה וּגְבוּרָה, תְּהִלָּה וְתִפְאֶרֶת, קְדֻשָּׁה וּמַלְכוּת, בְּרָכוֹת וְהוֹדָאוֹת לְשִׁמְךָ הַגָּדוֹל וְהַקָּדוֹשׁ, וּמֵעוֹלָם וְעַד עוֹלָם אַתָּה אֵל: בָּרוּךְ אַתָּה יְהֹוָה, אֵל מֶלֶךְ גָּדוֹל וּמְהֻלָּל בַּתִּשְׁבָּחוֹת, אֵל הַהוֹדָאוֹת, אֲדוֹן הַנִּפְלָאוֹת, בּוֹרֵא כָּל הַנְּשָׁמוֹת, רִבּון כָּל הַמַּעֲשִׂים, הַבּוֹחֵר בְּשִׁירֵי זִמְרָה, מֶלֶךְ יָחִיד, אֵל חֵי הָעוֹלָמִים: 



  `,
    value: 1,
    maxPerDay: 1,
  },
  {
    count: 0,
    name: "ברכת קרי''ש של שחרית",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, יוֹצֵר אוֹר וּבוֹרֵא חֹשֶׁךְ. עֹשֶׂה שָׁלוֹם וּבוֹרֵא אֶת הַכֹּל: 


  הַמֵּאִיר לָאָרֶץ וְלַדָּרִים עָלֶיהָ בְּרַחֲמִים, וּבְטוּבוֹ מְחַדֵּשׁ בְּכָל יוֹם תָּמִיד מַעֲשֵׂה בְּרֵאשִׁית. מָה רַבּוּ מַעֲשֶׂיךָ יְהֹוָה כֻּלָּם בְּחָכְמָה עָשִׂיתָ, מָלְאָה הָאָרֶץ קִנְיָנֶךָ. הַמֶּלֶךְ הַמְּרוֹמָם לְבַדּוֹ מֵאָז, הַמְּשֻׁבָּח וְהַמְּפוֹאָר וְהַמִּתְנַשֵּׂא מִימוֹת עוֹלָם. אֱלֹהֵי עוֹלָם, בְּרַחֲמֶיךָ הָרַבִּים רַחֵם עָלֵינוּ, אֲדוֹן עוּזֵּנוּ, צוּר מִשְׂגַּבֵּנוּ, מָגֵן יִשְׁעֵנוּ, מִשְׂגָּב בַּעֲדֵנוּ. אֵל בָּרוּךְ גְּדוֹל דֵּעָה, הֵכִין וּפָעַל זָהֳרֵי חַמָּה. טוֹב יָצַר כָּבוֹד לִשְׁמוֹ, מְאוֹרוֹת נָתַן סְבִיבוֹת עֻזּוֹ. פִּינוֹת צְבָאָיו קְדוֹשִׁים, רוֹמְמֵי שַׁדַּי, תָּמִיד מְסַפְּרִים כְּבוֹד אֵל וּקְדוּשָתוֹ. תִּתְבָּרֵךְ יְהֹוָה אֱלֹהֵינוּ בַּשָּׁמַיִם מִמַּעַל וְעַל הָאָרֶץ מִתָּחַת עַל כָּל שֶׁבַח מַעֲשֵׂה יָדֶיךָ וְעַל מְאוֹרֵי אוֹר שֶׁיָּצַרְתָּ הֵמָּה יְפָאֲרוּךָ סֶלָה: 
  
  
  תִּתְבָּרֵךְ לָנֶצַח צוּרֵנוּ מַלְכֵּנוּ וְגוֹאֲלֵנוּ בּוֹרֵא קְדוֹשִׁים, יִשְׁתַּבַּח שִׁמְךָ לָעַד מַלְכֵּנוּ יוֹצֵר מְשָׁרְתִים, וַאֲשֶׁר מְשָׁרְתָיו כֻּלָּם עוֹמְדִים בְּרוּם עוֹלָם וּמַשְׁמִיעִים בְּיִרְאָה יַחַד בְּקוֹל דִּבְרֵי אֱלֹהִים חַיִּים וּמֶלֶךְ עוֹלָם. כֻּלָּם אֲהוּבִים, כֻּלָּם בְּרוּרִים, כֻּלָּם גִּבּוֹרִים, כֻּלָּם קְדוֹשִׁים, וְכֻלָּם עוֹשִׂים בְּאֵימָה וּבְיִרְאָה רְצוֹן קוֹנָם, וְכֻלָּם פּוֹתְחִים אֶת פִּיהֶם בִּקְדוּשָׁה וּבְטָהֳרָה, בְּשִׁירָה וּבְזִמְרָה, וּמְבָרְכִין וּמְשַׁבְּחִין וּמְפָאֲרִין וּמַעֲרִיצִין וּמַקְדִּישִׁין וּמַמְלִיכִין. 
  
  
  אֶת שֵׁם הָאֵל הַמֶּלֶךְ הַגָּדוֹל הַגִּבּוֹר וְהַנּוֹרָא קָדוֹשׁ הוּא. וְכֻלָּם מְקַבְּלִים עֲלֵיהֶם עֹל מַלְכוּת שָׁמַיִם זֶה מִזֶּה, וְנוֹתְנִים בְּאַהֲבָה רְשׁוּת זֶה לָזֶה לְהַקְדִּישׁ לְיוֹצְרָם בְּנַחַת רוּחַ בְּשָׂפָה בְרוּרָה וּבִנְעִימָה, קְדֻשָׁה כֻּלָּם כְּאֶחָד עוֹנִים בְּאֵימָה, וְאוֹמְרִים בְּיִרְאָה: 
  
  
  
  קָדוֹשׁ | קָדוֹשׁ קָדוֹשׁ, יְהֹוָה צְבָאוֹת, מְלֹא כָל הָאָרֶץ כְּבוֹדוֹ: 
  
  
  וְהָאוֹפַנִּים וְחַיּוֹת הַקֹדֶשׁ בְּרַעַשׁ גָּדוֹל מִתְנַשְּׂאִים לְעֻמַּת שְׂרָפִים, לְעֻמָּתָם מְשַׁבְּחִים וְאוֹמְרִים: 
  
  
  
  בָּרוּךְ כְּבוֹד יְהֹוָה מִמְּקוֹמוֹ: 
  
  
  לָאֵל בָּרוּךְ נְעִימוֹת יִתֵּנוּ, לַמֶּלֶךְ אֵל חַי וְקַיָּם, זְמִירוֹת יֹאמֵרוּ וְתִשְׁבָּחוֹת יַשְׁמִיעוּ, כִּי הוּא לְבַדּוֹ מָרוֹם וְקָדוֹשׁ, פּוֹעֵל גְּבוּרוֹת, עוֹשֶׂה חֲדָשׁוֹת, בַּעַל מִלְחָמוֹת, זוֹרֵעַ צְדָקוֹת, מַצְמִיחַ יְשׁוּעוֹת, בּוֹרֵא רְפוּאוֹת, נוֹרָא תְהִלּוֹת, אֲדוֹן הַנִּפְלָאוֹת, הַמְחַדֵּשׁ בְּטוּבוֹֹ בְּכָל יוֹם תָּמִיד מַעֲשֵׂה בְרֵאשִׁית. כָּאָמוּר: לְעֹשֵׂה אוֹרִים גְּדֹלִים כִּי לְעוֹלָם חַסְדּוֹ. וְהִתְקִין מְאוֹרוֹת מְשַׂמֵּחַ עוֹלָמוֹ אֲשֶׁר בָּרָא. אוֹר חָדָשׁ עַל צִיּוֹן תָּאִיר, וְנִזְכֶּה כֻלָּנוּ (יַחַד) בִּמְהֵרָה לְאוֹרוֹ. בָּרוּךְ אַתָּה יְהֹוָה יוֹצֵר הַמְּאוֹרוֹת: 
  
  
  אַהֲבַת עוֹלָם (אַהֲבָה רַבָּה) אֲהַבְתָּנוּ יְהֹוָה אֱלֹהֵינוּ, חֶמְלָה גְּדוֹלָה וִיתֵרָה חָמַלְתָּ עָלֵינוּ. אָבִינוּ מַלְכֵּנוּ, בַּעֲבוּר שִׁמְךָ הַגָּדוֹל וּבַעֲבוּר אֲבוֹתֵינוּ שֶׁבָּטְחוּ בְּךָ וַתְּלַמְּדֵם חֻקֵּי חַיִּים לַעֲשׂוֹת רְצוֹנְךָ בְּלֵבָב שָׁלֵם, כֵּן תְּחָנֵּנוּ וּתְלַמְּדֵנוּ, אָבִינוּ אָב הָרַחֲמָן הַמְרַחֵם, רַחֵם עָלֵינוּ, וְתֵן בְּלִבֵּנוּ בִּינָה לְהָבִין, וּלְהַשְׂכִּיל, לִשְׁמֹעַ, לִלְמֹד וּלְלַמֵּד, לִשְׁמֹר וְלַעֲשׂוֹת וּלְקַיֵּים אֶת כָּל דִּבְרֵי תַּלְמוּד תוֹרָתֶךָ בְּאַהֲבָה: וְהָאֵר עֵינֵינוּ בְּתוֹרָתֶךָ וְדַבֵּק לִבֵּנוּ בְמִצְוֹתֶיךָ, וְיַחֵד לְבָבֵנוּ לְאַהֲבָה וּלְיִרְאָה אֶת שְׁמֶךָ. לְמַעַן לֹא נֵבוֹשׁ וְלֹא נִכָּלֵם וְלֹא נִכָּשֵׁל לְעוֹלָם וָעֶד. כִּי בְשֵׁם קָדְשְׁךָ הַגָּדוֹל הַגִּבּוֹר וְהַנּוֹרָא בָּטָחְנוּ, נָגִילָה וְנִשְׂמְחָה בִּישׁוּעָתֶךָ, וְרַחֲמֶיךָ יְהֹוָה אֱלֹהֵינוּ וַחֲסָדֶיךָ הָרַבִּים, אַל יַעַזְבוּנוּ נֶצַח סֶלָה וָעֶד: מַהֵר (יאחוז בארבע הציציות בידו השמאלית בין קמיצה לזרת כנגד הלב) וְהָבֵא עָלֵינוּ בְּרָכָה וְשָׁלוֹם מֵאַרְבַּע כַּנְפוֹת כָּל הָאָרֶץ, וּשְׁבוֹר עֻלֵּנוּ (עֹל הַגּוֹיִם) מֵעַל צַוָּארֵנוּ, וְתֹלִיכֵנוּ מְהֵרָה קוֹמְמִיּוּת לְאַרְצֵנוּ, כִּי אֵל פּוֹעֵל יְשׁוּעוֹת אָתָּה, וּבָנוּ בָחַרְתָּ מִכָּל עַם וְלָשׁוֹן, וְקֵרַבְתָּנוּ מַלְכֵּנוּ לְשִׁמְךָ הַגָּדוֹל סֶלָה בֶּאֱמֶת בְּאַהֲבָה, לְהוֹדוֹת לְךָ וּלְיַחֶדְךָ בְּאַהֲבָה, וּלְאַהֲבָה אֶת שְּׁמֶךָ, בָּרוּךְ אַתָּה יְהֹוָה, הַבּוֹחֵר בְּעַמּוֹ יִשְׂרָאֵל בְּאַהֲבָה: 
  
  
  יאמר הקריאת שמע באימה ביראה ברתת ובזיע, יכוון לקיים שלוש מצוות מן התורה: לקרוא קריאת שמע, לקבל אלהותו יתברך, ולהאמין ביחוד השם, וידקדק היטב באמירתה, ויזהר שלא יחבר התיבות זו עם זו, ויאמרה בכוונה גדולה, והכוונה כך: שמע ישראל - הבן ישראל, יְהֹוָה - אדון הכל היה הווה ויהיה, אֱלֹהֵינוּ - אֱלֹהִים שלנו שהוא תקיף ובעל היכולת ובעל הכוחות כולם, יְהֹוָה - כנ"ל, אחד - יחיד ומיוחד - שולט בשבעה רקיעים ובארץ ומושל בארבע רוחות עולם - יכוון שהוא מוכן למות על קידוש השם 
  
  
  
  (יחיד אומר: אֵל מֶלֶךְ נֶאֱמָן:) 
  
  
  
  שְׁמַ֖ע יִשְׂרָאֵ֑ל יְהֹוָ֥ה אֱלֹהֵ֖ינוּ יְהֹוָ֥ה | אֶחָֽד: 
  
  בלחש: בָּרוּךְ שֵּׁם כְּבוֹד מַלְכוּתוֹ לְעוֹלָם וָעֶד:
  
  וְאָ֣הַבְתָּ֔ אֵ֖ת יְהֹוָ֣ה אֱלֹהֶ֑יךָ בְּכָל לְבָֽבְךָ֥ וּבְכָל נַפְשְׁךָ֖ וּבְכָל מְאֹדֶֽךָ: וְהָי֞וּ הַדְּבָרִ֣ים הָאֵ֗לֶּה אֲשֶׁ֨ר אָֽנֹכִ֧י מְצַוְּךָ֛ הַיּ֖וֹם עַל לְבָבֶֽךָ: וְשִׁנַּנְתָּ֣ם לְבָנֶ֔יךָ וְדִבַּרְתָּ֖ בָּ֑ם בְּשִׁבְתְּךָ֤ בְּבֵיתֶ֨ךָ֙ וּבְלֶכְתְּךָ֣ בַדֶּ֔רֶךְ וּֽבְשָׁכְבְּךָ֖ וּבְקוּמֶֽךָ: וּקְשַׁרְתָּ֥ם לְא֖וֹת עַל יָדֶ֑ךָ וְהָי֥וּ לְטֹֽטָפֹ֖ת בֵּ֥ין עֵינֶֽיךָ: וּכְתַבְתָּ֛ם עַל מְזֻז֥וֹת בֵּיתֶ֖ךָ וּבִשְׁעָרֶֽיךָ: 
  
  
  וְהָיָ֗ה אִם שָׁמֹ֤עַ תִּשְׁמְעוּ֙ אֶל מִצְוֹתַ֔י אֲשֶׁ֧ר אָֽנֹכִ֛י מְצַוֶּ֥ה אֶתְכֶ֖ם הַיּ֑וֹם לְאַֽהֲבָ֞ה אֶת יְהֹוָ֤ה אֱלֹֽהֵיכֶם֙ וּלְעָבְד֔וֹ בְּכָל לְבַבְכֶ֖ם וּבְכָל נַפְשְׁכֶֽם: וְנָֽתַתִּ֧י מְטַֽר אַרְצְכֶ֛ם בְּעִתּ֖וֹ יוֹרֶ֣ה וּמַלְק֑וֹשׁ וְאָֽסַפְתָּ֣ דְגָנֶ֔ךָ וְתִירֽשְׁךָ֥ וְיִצְהָרֶֽךָ: וְנָֽתַתִּ֛י עֵ֥שֶׂב בְּשָֽׂדְךָ֖ לִבְהֶמְתֶּ֑ךָ וְאָֽכַלְתָּ֖ וְשָׂבָֽעְתָּ: הִשָּֽׁמְר֣וּ לָכֶ֔ם פֶּן יִפְתֶּ֖ה לְבַבְכֶ֑ם וְסַרְתֶּ֗ם וַֽעֲבַדְתֶּם֙ אֱלֹהִ֣ים אֲחֵרִ֔ים וְהִשְׁתַּֽחֲוִיתֶ֖ם לָהֶֽם: וְחָרָ֨ה אַף יְהֹוָ֜ה בָּכֶ֗ם וְעָצַ֤ר אֶת הַשָּׁמַ֨יִם֙ וְלֹא יִֽהְיֶ֣ה מָטָ֔ר וְהָ֣אֲדָמָ֔ה לֹ֥א תִתֵּ֖ן אֶת יְבוּלָ֑הּ וַֽאֲבַדְתֶּ֣ם מְהֵרָ֗ה מֵעַל֙ הָאָ֣רֶץ הַטֹּבָ֔ה אֲשֶׁ֥ר יְהֹוָ֖ה נֹתֵ֥ן לָכֶֽם: וְשַׂמְתֶּם֙ אֶת דְּבָרַ֣י אֵ֔לֶּה עַל לְבַבְכֶ֖ם וְעַֽל נַפְשְׁכֶ֑ם וּקְשַׁרְתֶּ֨ם אֹתָ֤ם לְאוֹת֙ עַל יֶדְכֶ֔ם וְהָי֥וּ לְטֽוֹטָפֹ֖ת בֵּ֥ין עֵֽינֵיכֶֽם: וְלִמַּדְתֶּ֥ם אֹתָ֛ם אֶת בְּנֵיכֶ֖ם לְדַבֵּ֣ר בָּ֑ם בְּשִׁבְתְּךָ֤ בְּבֵיתֶ֨ךָ֙ וּבְלֶכְתְּךָ֣ בַדֶּ֔רֶךְ וּֽבְשָׁכְבְּךָ֖ וּבְקוּמֶֽךָ: וּכְתַבְתָּ֛ם עַל מְזוּז֥וֹת בֵּיתֶ֖ךָ וּבִשְׁעָרֶֽיךָ: 
  
  
  לְמַ֨עַן יִרְבּ֤וּ יְמֵיכֶם֙ וִימֵ֣י בְנֵיכֶ֔ם עַ֚ל הָֽאֲדָמָ֔ה אֲשֶׁ֨ר נִשְׁבַּ֧ע יְהֹוָ֛ה לַֽאֲבֹֽתֵיכֶ֖ם לָתֵ֣ת לָהֶ֑ם כִּימֵ֥י הַשָּׁמַ֖יִם עַל הָאָֽרֶץ: 
  
  
  וַיֹּ֥אמֶר יְהֹוָ֖ה אֶל מֹשֶׁ֥ה לֵּאמֹֽר: דַּבֵּ֞ר אֶל בְּנֵ֤י יִשְׂרָאֵל֙ וְאָֽמַרְתָּ֣ אֲלֵהֶ֔ם וְעָשׂ֨וּ לָהֶ֥ם צִיצִ֛ת עַל כַּנְפֵ֥י בִגְדֵיהֶ֖ם לְדֹֽרֹתָ֑ם וְנָֽתְנ֛וּ עַל צִיצִ֥ת הַכָּנָ֖ף פְּתִ֥יל תְּכֵֽלֶת: וְהָיָ֣ה לָכֶם֘ לְצִיצִת֒ וּרְאִיתֶ֣ם אֹת֗וֹ וּזְכַרְתֶּם֙ אֶת כָּל מִצְוֹ֣ת יְהֹוָ֔ה וַֽעֲשִׂיתֶ֖ם אֹתָ֑ם וְלֹֽא תָת֜וּרוּ אַֽחֲרֵ֤י לְבַבְכֶם֙ וְאַֽחֲרֵ֣י עֵֽינֵיכֶ֔ם אֲשֶׁר אַתֶּ֥ם זֹנִ֖ים אַֽחֲרֵיהֶֽם: לְמַ֣עַן תִּזְכְּר֔וּ וַֽעֲשִׂיתֶ֖ם אֶת כָּל מִצְוֹתָ֑י וִֽהְיִיתֶ֥ם קְדֹשִׁ֖ים לֵֽאלֹהֵיכֶֽם: אֲנִ֞י יְהֹוָ֣ה אֱלֹֽהֵיכֶ֗ם אֲשֶׁ֨ר הוֹצֵ֤אתִי אֶתְכֶם֙ מֵאֶ֣רֶץ מִצְרַ֔יִם לִֽהְי֥וֹת לָכֶ֖ם לֵֽאלֹהִ֑ים אֲנִ֖י יְהֹוָ֥ה אֱלֹֽהֵיכֶֽם: אֱמֶת: 
  
  
  הש"ץ חוזר ואומר: יְהֹוָ֥ה אֱלֹֽהֵיכֶֽם אֱמֶת: 
  
  
  וְיַצִּיב, וְנָכוֹן, וְקַיָּם, וְיָשָׁר, וְנֶאֱמָן, וְאָהוּב, וְחָבִיב, וְנֶחְמָד, וְנָעִים, וְנוֹרָא, וְאַדִּיר, וּמְתוּקָן, וּמְקֻבָּל, וְטוֹב, וְיָפֶה, הַדָּבָר הַזֶּה עָלֵינוּ לְעוֹלָם וָעֶד. אֱמֶת, אֱלֹהֵי עוֹלָם מַלְכֵּנוּ צוּר יַעֲקֹב מָגֵן יִשְׁעֵנוּ, לְדוֹר וָדוֹר הוּא קַיָּם, וּשְׁמוֹ קַיָּם, וְכִסְאוֹ נָכוֹן, וּמַלְכוּתוֹ וֶאֱמוּנָתוֹ לָעַד קַיָּמֶת, וּדְבָרָיו חָיִּים וְקַיָּמִים, נֶאֱמָנִים וְנֶחֱמָדִים לָעַד ינשק הציציות ויניחם מידיו וּלְעוֹלְמֵי עוֹלָמִים. עַל אֲבוֹתֵינוּ וְעָלֵינוּ, עַל בָּנֵינוּ וְעַל דּוֹרוֹתֵינוּ וְעַל כָּל דּוֹרוֹת זֶרַע יִשְׂרָאֵל עֲבָדֶיךָ. 
  
  
  עַל הָרִאשׁוֹנִים וְעַל הָאַחֲרוֹנִים דָּבָר טוֹב וְקַיָּם לְעוֹלָם וָעֶד: אֱמֶת וֶאֱמוּנָה חֹק וְלֹא יַעֲבוֹר. אֱמֶת שָׁאַתָּה הוּא יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ. מַלְכֵּנוּ מֶלֶךְ אֲבוֹתֵינוּ. גּוֹאֲלֵנוּ גּוֹאֵל אֲבוֹתֵינוּ. יוֹצְרֵנוּ צוּר יְשׁוּעָתֵנוּ. פּוֹדֵנוּ וּמַצִּילֵנוּ מֵעוֹלָם הוּא שְׁמֶךָ, וְאֵין לָנוּ עוֹד אֱלֹהִים זוּלָתֶךָ סֶלָה: 
  
  
  עֶזְרַת אֲבוֹתֵינוּ אַתָּה הוּא מֵעוֹלָם, מָגֵן וּמושִׁיעַ לָהֶם וְלִבְנֵיהֶם אַחֲרֵיהֶם בְּכָל דּוֹר וָדוֹר, בְּרוּם עוֹלָם מוֹשָׁבֶךָ, וּמִשְׁפָּטֶיךָ, וְצִדְקָתְךָ עַד אַפְסֵי אָרֶץ, אֱמֶת אַשְׁרֵי אִישׁ שֶׁיִּשְׁמַע לְמִצְוֹתֶיךָ וְתוֹרָתְךָ וּדְבָרְךָ יָשִׂים עַל לִבּוֹ. אֱמֶת אַתָּה הוּא אָדוֹן לְעַמֶּךָ וּמֶלֶךְ גִּבּוֹר לָרִיב רִיבָם לְאָבוֹת וּבָנִים, אֱמֶת אַתָּה הוּא רִאשׁוֹן וְאַתָּה הוּא אַחֲרוֹן וּמִבַּלְעָדֶיךָ אֵין לָנוּ מֶלֶךְ גּוֹאֵל וּמוֹשִׁיעַ. אֱמֶת מִמִּצְרַיִם גְּאַלְתָּנוּ יְהֹוָה אֱלֹהֵינוּ, וּמִבֵּית עֲבָדִים פְּדִיתָנוּ, כָּל בְּכוֹרֵיהֶם הָרָגְתָּ, וּבְכוֹרְךָ יִשְׂרָאֵל גָּאָלְתָּ, וְיַם סוּף לָהֶם בָּקַעְתָּ, וְזֵדִים טִבַּעְתָּ, וִידִידִים הֶעֱבַרְתָּ (עָבְרוּ יָם). וַיְכַסּוּ מַיִם צָרֵיהֶם אֶחָד מֵהֶם לֹא נוֹתָר. עַל זֹאת שִׁבְּחוּ אֲהוּבִים, וְרוֹמְמוּ לָאֵל, וְנָתְנוּ יְדִידִים זְמִירוֹת שִׁירוֹת וְתִשְׁבָּחוֹת בְּרָכוֹת וְהוֹדָאוֹת לַמֶּלֶךְ אֵל חַי וְקַיָּם, רָם וְנִשָּׂא, גָּדוֹל וְנוֹרָא, מַשְׁפִּיל גֵּאִים עֲדֵי אָרֶץ, וּמַגְבִּיהַּ שְׁפָלִים עֲדֵי מָרוֹם, מוֹצִיא אֲסִירִים, וּפוֹדֶה עֲנָוִים, וְעוֹזֵר דַּלִּים, וְעוֹנֶה לְעַמּוֹ יִשְׂרָאֵל בְּעֵת שַׁוְּעָם אֵלָיו. תְּהִילוֹת לְאֵל עֶלְיוֹן גּוֹאֲלָם, בָּרוּךְ הוּא וּמְבוֹרָךְ, מֹשֶׁה וּבְנֵי יִשְׂרָאֵל לְךָ עָנוּ שִׁירָה בְשִׂמְחָה רַבָּה, וְאָמְרוּ כֻלָּם: 
  
  
  מִי כָמֹכָה בָּאֵלִים | יְהֹוָה, מִי כָּמֹכָה נֶאְדָּר בַּקֹּדֶשׁ, נוֹרָא תְהִלֹּת עֹשֵׂה פֶלֶא. 
  
  
  שִׁירָה חֲדָשָׁה שִׁבְּחוּ גְאוּלִים לְשִׁמְךָ הַגָּדוֹל עַל שְׂפַת הַיָּם, יַחַד כֻּלָּם הוֹדוּ וְהִמְלִיכוּ (וְאָמָרוּ) וְאָמְרוּ: 
  
  
  יְהֹוָה יִמְלֹךְ לְעוֹלָם וָעֶד. 
  
  
  צוּר יִשְׂרָאֵל קוּמָה בְּעֶזְרַת יִשְׂרָאֵל וּפְדֵה כִנְאֻמֶךָ יְהוּדָה וְיִשְׂרָאֵל וְנֶאֱמַר: גֹּאֲלֵנוּ יְהֹוָה צְבָאוֹת שְׁמוֹ קְדוֹשׁ יִשְׂרָאֵל. בָּרוּךְ אַתָּה יְהֹוָה גָּאַל יִשְׂרָאֵל
  `,
    value: 3,
    maxPerDay: 1,
  },
  { count: 0, name: "שמונה עשרה חול", full: ``, value: 19, maxPerDay: 3 },
  { count: 0, name: "עליה לתורה", full: ``, value: 2, maxPerDay: null },
  { count: 0, name: "הַגּוֹמֵל ", full: ``, value: 1, maxPerDay: null },
  { count: 0, name: "ברכת קרי''ש של ערבית", full: ``, value: 5, maxPerDay: 1 },
  { count: 0, name: "עַל סְפִירַת הָעֹמֶר", full: ``, value: 1, maxPerDay: 1 },
  { count: 0, name: "קידוש", full: ``, value: 1, maxPerDay: 1 },
  {
    count: 0,
    name: "ברכת המזון",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם. הַזָּן אֶת הָעוֹלָם כֻּלּוֹ. בְּטוּבוֹ בְּחֵן בְּחֶסֶד וּבְרַחֲמִים. הוּא נוֹתֵן לֶחֶם לְכָל בָּשָׂר. כִּי לְעוֹלָם חַסְדּוֹ: וּבְטוּבוֹ הַגָּדוֹל תָּמִיד לֹא חָסַר לָנוּ וְאַל יֶחְסַר לָנוּ מָזוֹן לְעוֹלָם וָעֶד. בַּעֲבוּר שְׁמוֹ הַגָּדוֹל. כִּי הוּא אֵל זָן וּמְפַרְנֵס לַכֹּל וּמֵטִיב לַכֹּל וּמֵכִין מָזוֹן לְכָל בְּרִיּוֹתָיו אֲשֶׁר בָּרָא. כָּאָמוּר פּוֹתֵחַ אֶת יָדֶךָ וּמַשְׂבִּיעַ לְכָל חַי רָצוֹן: בָּרוּךְ אַתָּה יְהֹוָה הַזָּן אֶת הַכֹּל: 


  נוֹדֶה לְּךָ יְהֹוָה אֱלֹהֵינוּ. עַל שֶׁהִנְחַלְתָּ לַאֲבוֹתֵינוּ אֶרֶץ חֶמְדָה טוֹבָה וּרְחָבָה. וְעַל שֶׁהוֹצֵאתָנוּ יְהֹוָה אֱלֹהֵינוּ מֵאֶרֶץ מִצְרַיִם. וּפְדִיתָנוּ מִבֵּית עֲבָדִים. וְעַל בְּרִיתְךָ שֶׁחָתַמְתָּ בִּבְשָׂרֵנוּ. וְעַל תּוֹרָתְךָ שֶׁלִּמַּדְתָּנוּ. וְעַל חֻקֶּיךָ שֶׁהוֹדַעְתָּנוּ. וְעַל חַיִּים חֵן וָחֶסֶד שֶׁחוֹנַנְתָּנוּ. וְעַל אֲכִילַת מָזוֹן שָׁאַתָּה זָן וּמְפַרְנֵס אוֹתָנוּ תָּמִיד. בְּכָל יוֹם וּבְכָל עֵת וּבְכָל שָׁעָה: 
  
  
  
  על הניסים
  
  --------------------------------------------------------------------------------
  בחנוכה ופורים אומרים כאן על הניסים: 
  
  וְעַל הַנִּסִּים וְעַל הַפֻּרְקָן וְעַל הַגְּבוּרוֹת וְעַל הַתְּשׁוּעוֹת וְעַל הַנִּפְלָאוֹת וְעַל הַנֶּחָמוֹת וְעַל הַמִּלְחָמוֹת שֶׁעָשִׂיתָ לַאֲבוֹתֵינוּ בַּיָּמִים הָהֵם בַּזְּמַן הַזֶּה. 
  
  
  בחנוכה אומרים: בִּימֵי מַתִּתְיָהוּ בֶן יוֹחָנָן כֹּהֵן גָּדוֹל חַשְׁמוֹנָאִי וּבָנָיו כְּשֶׁעָמְדָה מַלְכוּת יָוָן הָרְשָׁעָה עַל עַמְּךָ יִשְׂרָאֵל לְהַשְׁכִּיחָם תּוֹרָתֶךָ וּלְהַעֲבִירָם מֵחֻקֵּי רְצוֹנָךָ וְאַתָּה בְּרַחֲמֶיךָ הָרַבִּים עָמַדְתָּ לָהֶם בְּעֵת צָרָתָם רַבְתָּ אֶת רִיבָם דַּנְתָּ אֶת דִּינָם נָקַמְתָּ אֶת נִקְמָתָם מָסַרְתָּ גִבּוֹרִים בְּיַד חַלָּשִׁים וְרַבִּים בְּיַד מְעַטִּים וּטְמֵאִים בְּיַד טְהוֹרִים וּרְשָׁעִים בְּיַד צַדִּיקִים וְזֵדִים בְּיַד עוֹסְקֵי תוֹרָתֶךָ וּלְךָ עָשִׂיתָ שֵׁם גָּדוֹל וְקָדוֹשׁ בְּעוֹלָמָךְ וּלְעַמְּךָ יִשְׂרָאֵל עָשִׂיתָ תְּשׁוּעָה גְדוֹלָה וּפֻרְקָן כְּהַיּוֹם הַזֶּה וְאַחַר כָּךְ בָּאוּ בָנֶיךָ לִדְבִיר בֵּיתֶךָ וּפִנּוּ אֶת הֵיכָלֶךָ וְטִהֲרוּ אֶת מִקְדָּשֶׁךָ וְהִדְלִיקוּ נֵרוֹת בְּחַצְרוֹת קָדְשֶׁךָ וְקָבְעוּ שְׁמוֹנַת (יָמִים אֵלּוּ בְּהַלֵּל וּבְהוֹדָאָה וְעָשִׂיתָ עִמָּהֶם נֵס וָפֶלֶא וְנוֹדֶה לְשִׁמְךָ הַגָּדוֹל סֶלָה:) יְמֵי חֲנֻכָּה אֵלּוּ לְהוֹדוֹת וּלְהַלֵּל לְשִׁמְךָ הַגָּדוֹל: 
  
  
  בפורים אומרים: בִּימֵי מָרְדְּכַי וְאֶסְתֵּר בְּשׁוּשַׁן הַבִּירָה כְּשֶׁעָמַד עֲלֵיהֶם הָמָן הָרָשָׁע בִּקֵּשׁ לְהַשְׁמִיד לַהֲרוֹג וּלְאַבֵּד אֶת כָּל הַיְּהוּדִים מִנַּעַר וְעַד זָקֵן טַף וְנָשִׁים בְּיוֹם אֶחָד בִּשְׁלֹשָׁה עָשָׂר לְחֹדֶשׁ שְׁנֵים עָשָׂר הוּא חֹדֶשׁ אֲדָר וּשְׁלָלָם לָבוֹז וְאַתָּה בְּרַחֲמֶיךָ הָרַבִּים הֵפַרְתָּ אֶת עֲצָתוֹ וְקִלְקַלְתָּ אֶת מַחֲשַׁבְתּוֹ וַהֲשֵׁבוֹתָ לוֹ גְמוּלוֹ בְרֹאשׁוֹ וְתָלוּ אוֹתוֹ וְאֶת בָּנָיו עַל הָעֵץ (וְעָשִׂיתָ עִמָּהֶם נִסִּים וְנִפְלָאוֹת וְנוֹדֶה לְשִׁמְךָ הַגָּדוֹל): 
  
  
  
  וְעַל הַכּל יְהֹוָה אֱלֹהֵינוּ אֲנַחְנוּ מוֹדִים לָךְ וּמְבָרְכִים אוֹתָךְ. יִתְבָּרַךְ שִׁמְךָ בְּפִי כָּל חַי תָּמִיד לְעוֹלָם וָעֶד: כַּכָּתוּב. וְאָכַלְתָּ וְשָׂבָעְתָּ וּבֵרַכְתָּ אֶת יְהֹוָה אֱלֹהֶיךָ עַל הָאָרֶץ הַטֹּבָה אֲשֶׁר נָתַן לָךְ: בָּרוּךְ אַתָּה יְהֹוָה. עַל הָאָרֶץ וְעַל הַמָּזוֹן: 
  
  
  רַחֶם נָא יְהֹוָה אֱלֹהֵינוּ עַל יִשְׂרָאֵל עַמֶּךָ. וְעַל יְרוּשָׁלַיִם עִירֶךָ. וְעַל צִיּוֹן מִשְׁכַּן כְּבוֹדֶךָ. וְעַל מַלְכוּת בֵּית דָּוִד מְשִׁיחֶךָ. וְעַל הַבַּיִת הַגָּדוֹל וְהַקָּדוֹשׁ שֶׁנִּקְרָא שִׁמְךָ עָלָיו: אֱלֹהֵינוּ. אָבִינוּ. רְעֵנוּ זוּנֵנוּ פַּרְנְסֵנוּ וְכַלְכְּלֵנוּ וְהַרְוִיחֵנוּ. וְהַרְוַח לָנוּ יְהֹוָה אֱלֹהֵינוּ מְהֵרָה מִכָּל צָרוֹתֵינוּ. וְנָא אַל תַּצְרִיכֵנוּ יְהֹוָה אֱלֹהֵינוּ לֹא לִידֵי מַתְּנַת בָּשָׂר וָדָם וְלֹא לִידֵי הַלְוָאָתָם. כִּי אִם לְיָדְךָ הַמְּלֵאָה. הַפְּתוּחָה. הַקְּדוֹשָׁה וְהָרְחָבָה. שֶׁלֹּא נֵבוֹשׁ וְלֹא נִכָּלֵם (וְלֹא נִכָּשֵׁל) לְעוֹלָם וָעֶד: 
  
  
  
  
  
  בשבת מוסיפים: 
  רְצֵה וְהַחֲלִיצֵנוּ יְהֹוָה אֱלֹהֵינוּ בְּמִצְוֹתֶיךָ וּבְמִצְוַת יוֹם הַשְּׁבִיעִי הַשַּׁבָּת הַגָּדוֹל וְהַקָּדוֹשׁ הַזֶּה. כִּי יוֹם זֶה גָּדוֹל וְקָדוֹשׁ הוּא לְפָנֶיךָ לִשְׁבָּת בּוֹ וְלָנוּחַ בּוֹ בְּאַהֲבָה כְּמִצְוַת רְצוֹנֶךָ. וּבִרְצוֹנְךָ הָנִיחַ לָנוּ יְהֹוָה אֱלֹהֵינוּ שֶׁלֹּא תְהֵא צָרָה וְיָגוֹן וַאֲנָחָה בְּיוֹם מְנוּחָתֵנוּ. וְהַרְאֵנוּ יְהֹוָה אֱלֹהֵינוּ בְּנֶחָמַת צִיּוֹן עִירֶךָ וּבְבִנְיַן יְרוּשָׁלַיִם עִיר קָדְשֶׁךָ כִּי אַתָּה הוּא בַּעַל הַיְשׁוּעוֹת וּבַעַל הַנֶּחָמוֹת: 
  
  
  
  בראש חודש ובחול המועד אומרים כאן "יעלה ויבא": 
  
  אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, יַעֲלֶה וְיָבֹא, וְיַגִּיעַ וְיֵרָאֶה וְיֵרָצֶה, וְיִשָּׁמַע וְיִפָּקֵד וְיִזָּכֵר, זִכְרוֹנֵנוּ וּפִקְדוֹנֵנו וְזִכְרוֹן אֲבוֹתֵינוּ, וְזִכְרוֹן מָשִׁיחַ בֶּן דָּוִד עַבְדָּךְ, וְזִכְרוֹן יְרוּשָׁלַיִם עִיר קָדְשֶׁךָ, וְזִכְרוֹן כָּל עַמְּךָ בֵּית יִשְׂרָאֵל לְפָנֶיךָ, לִפְלֵטָה, לְטוֹבָה, לְחֵן וּלְחֶסֶד וּלְרַחֲמִים לְחַיִּים טוֹבִים וּלְשָׁלוֹם בְּיוֹם: 
  
  בראש חדש:    רֹאֹשׁ הַחֹדֶשׁ 
  בפסח:   חַג הַמַּצּוֹת 
  בשבועות:   חַג הַשָּׁבֻעוֹת 
  בסוכות:   חַג הַסֻּכּוֹת 
  בשמ"ע ובש"ת:   שְׁמִינִי עֲצֶרֶת הַחַג 
  בר"ה:   הַזִּכָּרוֹן 
  ילדים האוכלים ביו"כ:   הַכִּפּוּרִים 
  
  
  הַזֶּה. זָכְרֵנוּ יְהֹוָה אֱלֹהֵינוּ בּוֹ לְטוֹבָה, וּפָקְדֵנוּ בוֹ לִבְרָכָה, וְהוֹשִׁיעֵנוּ בוֹ לְחַיִּים טוֹבִים, וּבִדְבַר יְשׁוּעָה וְרַחֲמִים. חוּס וְחָנֵּנוּ, וְרַחֵם עָלֵינוּ וְהוֹשִׁיעֵנוּ, כִּי אֵלֶיךָ עֵינֵינוּ, כִּי אֵל מֶלֶךְ חַנּוּן וְרַחוּם אָתָּה:
  
  
  
  
  דיני שכחה: 
  
  שכח לומר רצה בשבת או יעלה ויבא בראש חודש ויום טוב וחול המועד ונזכר קודם שאמר השם מברכת בונה ירושלים אומרו שם אבל אם אמר השם אם נזכר קודם שהתחיל הטוב והמטיב אומר: 
  
  
  בשבת אומר:    
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם אֲשֶׁר נָתַן שַׁבָּתוֹת לִמְנוּחָה לְעַמּוֹ יִשְׂרָאֵל בְּאַהֲבָה לְאוֹת וְלִבְרִית: בָּרוּךְ אַתָּה יְהֹוָה מְקַדֵּשׁ הַשַּׁבָּת: 
  
  
  ביו"ט אומר:    
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם אֲשֶׁר נָתַן יָמִים טוֹבִים לְעַמּוֹ יִשְׂרָאֵל לְשָׂשׂוֹן וּלְשִׂמְחָה אֶת יוֹם חַג (פלוני) הַזֶּה: בָּרוּךְ אַתָּה יְהֹוָה מְקַדֵּשׁ יִשְׂרָאֵל וְהַזְּמַנִים: 
  
  
  ביו"ט שחל בשבת:    
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם אֲשֶׁר נָתַן שַׁבָּתוֹת לִמְנוּחָה לְעַמּוֹ יִשְׂרָאֵל בְּאַהֲבָה לְאוֹת וְלִבְרִית וְיָמִים טוֹבִים לְשָׂשׂוֹן וּלְשִׂמְחָה אֶת יוֹם חַג (פלוני) הַזֶּה: בָּרוּךְ אַתָּה יְהֹוָה מְקַדֵּשׁ הַשַּׁבָּת וְיִשְׂרָאֵל וְהַזְמַנִּים: 
  
  
  בראש השנה:    
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם אֲשֶׁר נָתַן יָמִים טוֹבִים לְעַמּוֹ יִשְׂרָאֵל אֶת יוֹם הַזִּכָּרוֹן הַזֶּה: בָּרוּךְ אַתָּה יְהֹוָה מְקַדֵּשׁ יִשְׂרָאֵל וְיוֹם הַזִּכָּרוֹן: 
  
  
  בראש השנה שחל בשבת:    
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם אֲשֶׁר נָתַן שַׁבָּתוֹת לִמְנוּחָה לְעַמּוֹ יִשְׂרָאֵל בְּאַהֲבָה לְאוֹת וְלִבְרִית וְיָמִים טוֹבִים לְיִשְׂרָאֵל אֶת יוֹם הַזִּכָּרוֹן הַזֶּה: בָּרוּךְ אַתָּה יְהֹוָה מְקַדֵּשׁ הַשַּׁבָּת וְיִשְׂרָאֵל וְיוֹם הַזִּכָּרוֹן: 
  
  
  בראש חודש:    
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם אֲשֶׁר נָתַן רָאשֵׁי חֳדָשִׁים לְעַמּוֹ יִשְׂרָאֵל לְזִכָּרוֹן: (ואינו חותם) 
  
  
  בראש חודש שחל בשבת:    
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם אֲשֶׁר נָתַן שַׁבָּתוֹת לִמְנוּחָה לְעַמּוֹ יִשְׂרָאֵל בְּאַהֲבָה לְאוֹת וְלִבְרִית וְרָאשֵׁי חֳדָשִׁים לְזִכָּרוֹן: בָּרוּךְ אַתָּה יְהֹוָה מְקַדֵּשׁ הַשַּׁבָּת וְיִשְׂרָאֵל וְרָאשֵׁי חֳדָשִׁים: 
  
  
  
  וּבְנֵה יְרוּשָׁלַיִם עִיר הַקֹּדֶשׁ בִּמְהֵרָה בְּיָמֵינוּ. בָּרוּךְ אַתָּה יְהֹוָה. בּוֹנֵה בְרַחֲמָיו יְרוּשָׁלָיִם. אָמֵן: 
  
  בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם. הָאֵל. אָבִינוּ. מַלְכֵּנוּ. אַדִּירֵנוּ. בּוֹרְאֵנוּ. גּוֹאֲלֵנוּ. יוֹצְרֵנוּ. קְדוֹשֵׁנוּ קְדוֹשׁ יַעֲקֹב. רוֹעֵנוּ רוֹעֵה יִשְׂרָאֵל. הַמֶּלֶךְ הַטּוֹב וְהַמֵּטִיב לַכֹּל. שֶׁבְּכָל יוֹם וָיוֹם הוּא הֵטִיב הוּא מֵטִיב הוּא יֵיטִיב לָנוּ. הוּא גְמָלָנוּ הוּא גוֹמְלֵנוּ הוּא יִגְמְלֵנוּ לָעַד לְחֵן וּלְחֶסֶד וּלְרַחֲמִים וּלְרֶוַח. הַצָּלָה וְהַצְלָחָה. בְּרָכָה וִישׁוּעָה. נֶחָמָה. פַּרְנָסָה וְכַלְכָּלָה. וְרַחֲמִים וְחַיִּים וְשָׁלוֹם וְכָל טוֹב. וּמִכָּל טוּב לְעוֹלָם אַל יְחַסְּרֵנוּ: 
  
  
  הָרַחֲמָן הוּא יִמְלֹךְ עָלֵינוּ לְעוֹלָם וָעֶד: הָרַחֲמָן הוּא יִתְבָּרַךְ בַּשָּׁמַיִם וּבָאָרֶץ: הָרַחֲמָן הוּא יִשְׁתַּבַּח לְדוֹר דּוֹרִים. וְיִתְפָּאַר בָּנוּ לָעַד וּלְנֵצַח נְצָחִים. וְיִתְהַדַּר בָּנוּ לָעַד וּלְעוֹלְמֵי עוֹלָמִים: הָרַחֲמָן הוּא יְפַרְנְסֵנוּ בְּכָבוֹד: הָרַחֲמָן הוּא יִשְׁבֹּר עֻלֵנוּ מֵעַל צַוָּארֵנוּ וְהוּא יוֹלִיכֵנוּ קוֹמְמִיּוּת לְאַרְצֵנוּ: הָרַחֲמָן הוּא יִשְׁלַח לָנוּ בְּרָכָה מְרֻבָּה בַּבַּיִת הַזֶּה וְעַל שֻׁלְחָן זֶה שֶׁאָכַלְנוּ עָלָיו: הָרַחֲמָן הוּא יִשְׁלַח לָנוּ אֶת אֵלִיָּהוּ הַנָּבִיא זָכוּר לַטּוֹב וִיבַשֶּׂר לָנוּ בְּשׂוֹרוֹת טוֹבוֹת יְשׁוּעוֹת וְנֶחָמוֹת: 
  
  
  
  אם הוא אוכל על שלחן אחרים יברך לבעה"ב ואפילו בנים הסמוכים על שלחן אביהם, וגם האב הנסמך על שלחן בניו וגם אשתו תאמר כן: 
  לזכר: 
  יְהִי רָצוֹן שֶׁלֹּא יֵבוֹשׁ בַּעַל הַבַּיִת בָּעוֹלָם הַזֶּה וְלֹא יִכָּלֵם לָעוֹלָם הַבָּא. וְיִצְלַח מְאֹד בְּכָל נְכָסָיו. וְיִהְיוּ נְכָסָיו וּנְכָסֵינוּ מוּצְלָחִים וּקְרוֹבִים לָעִיר. וְאַל יִשְׁלוֹט שָׂטָן לֹא בְּמַעֲשֵׂה יָדָיו וְלֹא בְּמַעֲשֵׂה יָדֵינוּ. וְאַל יִזְדָקֵּק לֹא לְפָנָיו וְלֹא לְפָנֵינוּ שׁוּם דְבַר הִרְהוּר חֵטְא וַעֲבֵירָה וְעָוֹן מַעַתָּה וְעַד עוֹלָם: 
  לנקבה: 
  יְהִי רָצוֹן שֶׁלֹּא תֵּבוֹשׁ בַּעֲלַת הַבַּיִת בָּעוֹלָם הַזֶּה וְלֹא תִכָּלֵם לָעוֹלָם הַבָּא. וְתִצְלַח מְאֹד בְּכָל נְכָסֶיהָ. וְיִהְיוּ נְכָסֶיהָ וּנְכָסֵינוּ מוּצְלָחִים וּקְרוֹבִים לָעִיר. וְאַל יִשְׁלוֹט שָׂטָן לֹא בְּמַעֲשֵׂה יָדֶיהָ וְלֹא בְּמַעֲשֵׂה יָדֵינוּ. וְאַל יִזְדָקֵּק לֹא לְפָנֶיהָ וְלֹא לְפָנֵינוּ שׁוּם דְבַר הִרְהוּר חֵטְא וַעֲבֵירָה וְעָוֹן מַעַתָּה וְעַד עוֹלָם:
  
  
  הָרַחֲמָן הוּא יְבָרֵךְ אֶת (אָבִי מוֹרִי) בַּעַל הַבַּיִת הַזֶּה וְאֶת (אִמִּי מוֹרָתִי) בַּעֲלַת הַבַּיִת הַזֶּה. אוֹתָם וְאֶת בֵּיתָם וְאֶת זַרְעָם וְאֶת כָּל אֲשֶׁר לָהֶם. (ואם סמוך על שלחן עצמו יאמר:) הָרַחֲמָן הוּא יְבָרֵךְ אוֹתִי וְאֶת אִשְׁתִּי וְאֶת זַרְעִי וְאֶת כָּל אֲשֶׁר לִי, אוֹתָנוּ וְאֶת כָּל אֲשֶׁר לָנוּ. כְּמוֹ שֶׁנִּתְבָּרְכוּ אֲבוֹתֵינוּ אַבְרָהָם יִצְחָק וְיַעֲקֹב, בַּכּל. מִכֹּל. כֹּל. כֵּן יְבָרֵךְ אוֹתָנוּ כֻּלָּנוּ יַחַד בִּבְרָכָה שְׁלֵמָה. וְנֹאמַר אָמֵן: 
  
  
  בַּמָּרוֹם יְלַמְּדוּ עֲלֵיהֶם וְעָלֵינוּ זְכוּת שֶׁתְּהֵא לְמִשְׁמֶרֶת שָׁלוֹם. וְנִשָּׂא בְרָכָה מֵאֵת יְהֹוָה. וּצְדָקָה מֵאֱלֹהֵי יִשְׁעֵנוּ. וְנִמְצָא חֵן וְשֵׂכֶל טוֹב בְּעֵינֵי אֱלֹהִים וְאָדָם: 
  
  
  
  
  --------------------------------------------------------------------------------
  
  
  הרחמן לברית מילה
  
  
  
  
  
  סדר הרחמן לסעודת ברית מילה: 
  
  הָרַחֲמָן, הוּא יְבָרֵךְ אֲבִי הַיֶלֶד וְאִמּוֹ, וְיִזְכּוּ לְגַדְּלוֹ וּלְחַנְּכוֹ וּלְחַכְּמוֹ, מִיּוֹם הַשְּׁמִינִי וָהָלְאָה יֵרָצֶה דָמוֹ, וִיהִי יְהֹוָה אֱלֹהָיו עִמּוֹ. (אמן:) 
  
  הָרַחֲמָן, הוּא יְבָרֵךְ בַּעַל בְּרִית הַמִּילָה, אֲשֶׁר שָׂשׂ לַעֲשׂוֹת צֶדֶק בְּגִילָה, וִישַׁלֵּם פָּעֳלוֹ וּמַשְׂכֻּרְתּוֹ כְּפוּלָה, וְיִתְּנֵהוּ לְמַעְלָה לְמַעְלָה. (אמן:) 
  
  
  הָרַחֲמָן, הוּא יְבָרֵךְ רַךְ הַנִמוֹל לִשְׁמוֹנָה, וְיִהְיוּ יָדָיו וְלִבּוֹ לָאֵל אֱמוּנָה, וְיִזְכֶּה לִרְאוֹת פְּנֵי הַשְּׁכִינָה, שָׁלשׁ פְּעָמִים בַּשָּׁנָה. (אמן:) 
  
  
  הָרַחֲמָן, הוּא יְבָרֵךְ הַמָּל בְּשַׂר הָעָרְלָה, וּפָרַע וּמָצַץ דְּמֵי הַמִּילָה, אִישׁ הַיָּרֵא וְרַךְ הַלֵּבָב עֲבוֹדָתוֹ כְּשֵׁרָה, אִם שְׁלָשׁ אֵלֶּה יַעֲשֶׂה לָה. (פְּסוּלָה אִם שְׁלָשׁ לֹא אֵלֶּה יַעֲשֶׂה לָה) (אמן:) 
  
  
  הָרַחֲמָן, הוּא יִשְׁלַח לָנוּ מְשִׁיחוֹ הוֹלֵךְ תָּמִים, בִּזְכוּת חֲתַן לַמּוּלוֹת דָּמִים, לְבַשֵּׂר בְּשׂוֹרוֹת טוֹבוֹת וְנִחוּמִים, לְעַם אֶחָד מְפֻזָּר וּמְפֹרָד בֵּין הָעַמִּים. (אמן:) 
  
  
  הָרַחֲמָן, הוּא יִשְׁלַח לָנוּ כֹּהֵן צֶדֶק אֲשֶׁר לֻקַּח לְעֵילוֹם, עַד הוּכַן כִּסְאוֹ כַּשֶּׁמֶשׁ וְיָהֲלוֹם, וַיָּלֶט פָּנָיו בְּאַדַּרְתּוֹ וַיִּגְלוֹם, בְּרִיתִי הָיְתָה אִתּוֹ הַחַיִּים וְהַשָּׁלוֹם. (אמן:) 
  
  
  בשבת: הָרַחֲמָן הוּא יַנְחִילֵנוּ יוֹם שֶׁכֻּלּוֹ שַׁבָּת וּמְנוּחָה לְחַיֵּי הָעוֹלָמִים: 
  
  בראש חדש: הָרַחֲמָן הוּא יְחַדֵּשׁ עָלֵינוּ אֶת הַחֹדֶשׁ הַזֶּה לְטוֹבָה וְלִבְרָכָה: 
  
  
  ביום טוב: הָרַחֲמָן הוּא יַנְחִילֵנוּ יוֹם שֶׁכֻּלּוֹ טוֹב: 
  
  
  לב' לילות ראשונות של פסח: הָרַחֲמָן הוּא יַנְחִילֵנוּ יוֹם שֶׁכֻּלּוֹ טוֹב: לְיוֹם שֶׁכֻּלּוֹ אָרוּךְ לְיוֹם שֶׁצַּדִּיקִים יוֹשְׁבִין וְעַטְרוֹתֵיהֶם בְּרָאשֵׁיהֶם וְנֶהֱנִין מִזִּיו הַשְּׁכִינָה וִיהִי חֶלְקֵנוּ עִמָּהֶם: 
  
  
  בראש השנה: הָרַחֲמָן הוּא יְחַדֵּשׁ עָלֵינוּ אֶת הַשָּׁנָה הַזֹּאת לְטוֹבָה וְלִבְרָכָה: 
  
  
  בסוכות: הָרַחֲמָן הוּא יָקִים לָנוּ אֶת סֻכַּת דָּוִד הַנּוֹפָלֶת: 
  
  
  הָרַחֲמָן הוּא יְזַכֵּנוּ לִימוֹת הַמָשִׁיחַ וּלְחַיֵּי הָעוֹלָם הַבָּא: בחול: מַגְדִּיל (ביום שיש בו מוסף אומר: מִגְדּוֹל) יְשׁוּעוֹת מַלְכּוֹ וְעֹשֶׂה חֶסֶד לִמְשִׁיחוֹ לְדָוִד וּלְזַרְעוֹ עַד עוֹלָם: עֹשֶׂה שָׁלוֹם בִּמְרוֹמָיו הוּא יַעֲשֶׂה שָׁלוֹם עָלֵינוּ וְעַל כָּל יִשְׂרָאֵל וְאִמְרוּ אָמֵן: 
  
  
  יְראוּ אֶת יְהֹוָה קְדוֹשָׁיו כִּי אֵין מַחְסוֹר לִירֵאָיו: כְּפִירִים רָשׁוּ וְרָעֵבוּ וְדוֹרְשֵׁי יְהֹוָה לֹא יַחְסְרוּ כָל טוֹב: הוֹדוּ לַיהֹוָה כִּי טוֹב כִּי לְעוֹלָם חַסְדּוֹ: פּוֹתֵחַ אֶת יָדֶךָ וּמַשְׂבִּיעַ לְכָל חַי רָצוֹן: בָּרוּךְ הַגֶּבֶר אֲשֶׁר יִבְטַח בַּיהֹוָה וְהָיָה יְהֹוָה מִבְטַחוֹ: נַעַר הָיִיתִי גַם זָקַנְתִּי וְלֹא רָאִיתִי צַדִּיק נֶעֱזָב וְזַרְעוֹ מְבַקֶּשׁ לָחֶם: יְהֹוָה עֹז לְעַמּוֹ יִתֵּן יְהֹוָה יְבָרֵךְ אֶת עַמּוֹ בַשָּׁלוֹם
  `,
    value: 4,
    maxPerDay: null,
  },
  {
    count: 0,
    name: "בּוֹרֵא פְּרִי הָעֵץ",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם בּוֹרֵא פְּרִי הָעֵץ`,
    value: 1,
    maxPerDay: null,
  },
  {
    count: 0,
    name: "בּוֹרֵא פְּרִי הָאֲדָמָה",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם בּוֹרֵא פְּרִי הָאֲדָמָה`,
    value: 1,
    maxPerDay: null,
  },
  {
    count: 0,
    name: "שֶׁהַכֹּל ניהיה בִּדְבָרו",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם שֶׁהַכֹּל נִהְיָה בִּדְבָרוֹ`,
    value: 1,
    maxPerDay: null,
  },
  {
    count: 0,
    name: "בּוֹרֵא פְּרִי הַגֶּפֶן",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם בּוֹרֵא פְּרִי הַגָּפֶן`,
    value: 1,
    maxPerDay: null,
  },
  {
    count: 0,
    name: "בּוֹרֵא מִינֵי מְזוֹנוֹת",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם בּוֹרֵא מִינֵי מְזוֹנוֹת`,
    value: 1,
    maxPerDay: null,
  },
  {
    count: 0,
    name: "ברכה אחרונה מעין שלוש",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם: 
    על היין: עַל הַגֶּפֶן וְעַל פְּרִי הַגֶּפֶן: 
    על פירות משבעת המינים: עַל הָעֵץ וְעַל פְּרִי הָעֵץ: 
    על מזונות: עַל הַמִחְיָה וְעַל הַכַּלְכָּלָה: 
    על מזונות ויין ביחד: עַל הַמִּחְיָה וְעַל הַכַּלְכָּלָה וְעַל הַגֶּפֶן וְעַל פְּרִי הַגֶּפֶן: 
    
    
    וְעַל תְּנוּבַת הַשָּׂדֶה וְעַל אֶרֶץ חֶמְדָּה טוֹבָה וּרְחָבָה שֶׁרָצִיתָ וְהִנְחַלְתָּ לַאֲבוֹתֵינוּ לֶאֱכֹל מִפִּרְיָהּ וְלִשְׂבּוֹעַ מִטּוּבָהּ, רַחֵם (נָא) יְהֹוָה אֱלֹהֵינוּ עַל יִשְׂרָאֵל עַמֶּךָ וְעַל יְרוּשָׁלַיִם עִירֶךָ וְעַל צִיּוֹן מִשְׁכַּן כְּבוֹדֶךָ וְעַל מִזְבְּחֶךָ וְעַל הֵיכָלֶךָ, וּבְנֵה יְרוּשָׁלַיִם עִיר הַקֹּדֶשׁ בִּמְהֵרָה בְּיָמֵינוּ וְהַעֲלֵנוּ לְתוֹכָהּ וְשַׂמְּחֵנוּ בְּבִנְיָנָהּ וְנֹאכַל מִפִּרְיָּהּ וְנִשְׂבַּע מִטּוּבָהּ וּנְבָרֶכְךָ עָלֶיהָ בִּקְדֻשָּׁה וּבְטָהֳרָה: 
    
    
    (בשבת:) וּרְצֵה וְהַחֲלִיצֵנוּ בְּיוֹם הַשַּׁבָּת הַזֶּה: 
    (בר"ח:) וְזָכְרֵנוּ לְטוֹבָה בְּיוֹם רֹאשׁ הַחֹדֶשׁ הַזֶּה: 
    (בר"ה:) וְזָכְרֵנוּ לְטוֹבָה בְּיוֹם הַזִּכָּרוֹן הַזֶּה: 
    (ביו"ט:) וְשַׂמְחֵנוּ בְּיוֹם חַג (פלוני) הַזֶּה: 
    
    
    כִּי אַתָּה יְהֹוָה טוֹב וּמֵטִיב לַכֹּל וְנוֹדֶה לְךָ עַל הָאָרֶץ וְעַל: 
    
    
    (על היין:) פְּרִי הַגָּפֶן: בָּרוּךְ אַתָּה יְהֹוָה עַל הָאָרֶץ וְעַל פְּרִי הַגָּפֶן: (בא"י וְעַל פְּרִי גַפְנָהּ): 
    
    
    (על הפירות:) הַפֵּרוֹת: בָּרוּךְ אַתָּה יְהֹוָה עַל הָאָרֶץ וְעַל הַפֵּרוֹת: (בא"י וְעַל פֵּרוֹתֶיהָ): 
    
    
    (על מזונות:) הַמִחְיָה: בָּרוּךְ אַתָּה יְהֹוָה עַל הָאָרֶץ וְעַל הַמִחְיָה וְעַל הַכַּלְכָּלָה: 
    
    
    (על מזונות ויין ביחד:) הַמִּחְיָה וְעַל פְּרִי הַגָּפֶן: בָּרוּךְ אַתָּה יְהֹוָה עַל הָאָרֶץ וְעַל הַמִחְיָה וְעַל הַכַּלְכָּלָה וְעַל פְּרִי הַגָּפֶן: (בא"י וְעַל פְּרִי גַפְנָהּ): 
    
    `,
    value: 1,
    maxPerDay: null,
  },
  {
    count: 0,
    name: "בּוֹרֵא נְפָשׁוֹת",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם בּוֹרֵא נְפָשׁוֹת רַבּוֹת וְחֶסְרוֹנָן עַל כָּל מַה שֶׁבָּרָאתָ לְהַחֲיוֹת בָּהֶם נֶפֶשׁ כָּל חָי. בָּרוּךְ חֵי הָעוֹלָמִים`,
    value: 1,
    maxPerDay: null,
  },
  {
    count: 0,
    name: "שֶׁהֶחֱיָנוּ",
    full: `בָּרוּךְ אַתָּה יְהֹוָה אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם שֶׁהֶחֱיָנוּ וְקִיְּמָנוּ וְהִגִּיעָנוּ לַזְמַן הַזֶּה:`,
    value: 1,
    maxPerDay: null,
  },
  {
    count: 0,
    name: "בּוֹרֵא מִינֵי בְשָׂמִים",
    full: `בָּרוּךְ אַתָּה יְהֹוָה, אֱלֹהֵינוּ מֶלֶךְ הָעוֹלָם, בּוֹרֵא מִינֵי בְשָׂמִים`,
    value: 1,
    maxPerDay: 1,
  },
  // { count: 0, name: "", full: ``, value: 1, maxPerDay: 1 },
];

const tefiles = ["שחרית", "מנחה", "מערב"];

export default brochos;
